package Day03;

public class StackAndQue {
// 스택 : 삽입과 삭제 연산이 후입선출로 이루어지는 자료구조
    // 후입선출은 삽입과 삭제가 한 쪽에서만 일어나는 특징이 있음
    // 스택 용어
    // top : 삽입과 삭제가 일어나는 위치
    // push : top 위치에 새로운 데이터를 삽입하는 연산
    // pop : top 위치에 현재 있는 데이터를 삭제하고 확인하는 연산
    // peek : top 위치에 현재 있는 데이터를 단순 확인하는 연산
// 큐 : 삽입과 삭제 연산이 선입선출로 이루어지는 자료구조
    // 큐 용어
    // rear : 큐에서 가장 끝의 데이터를 가리키는 말
    // front : 큐에서 가장 앞의 데이터를 가리키는 영역
    // add : rear 부분에 새로운 데이터를 삽입하는 연산
    // poll : front 부분에 있는 데이터를 삭제하고 확인하는 연산
    // peek : 큐의 맨 앞에 있는 데이터를 확인할 때 사용하는 연산
}
